{"activity_id":1,"activity_name":"Create","actor":{"user":{"email_addr":"vinaykattimani11@gmail.com","name":"vinaykattimani1","type":"User","type_id":1,"uid":"vinaykattimani1"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.create","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"Sa1gk4bsQ3aNHDUaDoz2Lw","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697708516105,\"_document_id\":\"Sa1gk4bsQ3aNHDUaDoz2Lw\",\"action\":\"repo.create\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"actor_location\":{\"country_code\":\"AU\"},\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697708516105,\"operation_type\":\"create\",\"org\":\"neworgtinu3\",\"org_id\":148334596,\"public_repo\":false,\"repo\":\"neworgtinu3/tinurepo2\",\"repo_id\":707134518,\"request_category\":\"other\",\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/118.0.0.0 Safari/537.36 Edg/118.0.2088.46\",\"visibility\":\"internal\"}","severity_id":0,"status":"Success","status_id":1,"time":1697708516105,"type_name":"Web Resources Activity: Create","type_uid":600101,"web_resources":[]}
{"activity_id":99,"activity_name":"Other","actor":{"user":{"email_addr":"vinaykattimani11@gmail.com","name":"vinaykattimani1","type":"User","type_id":1,"uid":"vinaykattimani1"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.change_merge_setting","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"SY6ZrJk2DeP-Q_fPiRYw4Q","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697708515750,\"_document_id\":\"SY6ZrJk2DeP-Q_fPiRYw4Q\",\"action\":\"repo.change_merge_setting\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"actor_location\":{\"country_code\":\"AU\"},\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697708515750,\"operation_type\":\"modify\",\"org\":\"neworgtinu3\",\"org_id\":148334596,\"public_repo\":false,\"repo\":\"neworgtinu3/tinurepo2\",\"repo_id\":707134518,\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/118.0.0.0 Safari/537.36 Edg/118.0.2088.46\",\"visibility\":\"internal\"}","severity_id":0,"status":"Success","status_id":1,"time":1697708515750,"type_name":"Web Resources Activity: Other","type_uid":600199,"web_resources":[]}
{"activity_id":99,"activity_name":"Other","actor":{"user":{"email_addr":"vinaykattimani11@gmail.com","name":"vinaykattimani1","type":"User","type_id":1,"uid":"vinaykattimani1"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.change_merge_setting","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"5PVHaBYPGhTDJDRAl5vqlQ","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697708515728,\"_document_id\":\"5PVHaBYPGhTDJDRAl5vqlQ\",\"action\":\"repo.change_merge_setting\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"actor_location\":{\"country_code\":\"AU\"},\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697708515728,\"operation_type\":\"modify\",\"org\":\"neworgtinu3\",\"org_id\":148334596,\"public_repo\":false,\"repo\":\"neworgtinu3/tinurepo2\",\"repo_id\":707134518,\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/118.0.0.0 Safari/537.36 Edg/118.0.2088.46\",\"visibility\":\"internal\"}","severity_id":0,"status":"Success","status_id":1,"time":1697708515728,"type_name":"Web Resources Activity: Other","type_uid":600199,"web_resources":[]}
